-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jan 14, 2024 at 09:27 AM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `cms`
--

-- --------------------------------------------------------

--
-- Table structure for table `posts`
--

CREATE TABLE `posts` (
  `id` int(11) NOT NULL,
  `date` varchar(255) NOT NULL,
  `title` varchar(255) NOT NULL,
  `summary` text NOT NULL,
  `content` mediumtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `posts`
--

INSERT INTO `posts` (`id`, `date`, `title`, `summary`, `content`) VALUES
(2, '2024/01/03', 'สวัสดีชาวโลก', 'ทดสอบระบบ', 'เมื่อตะวันตกจะหลับหลาย และตะวันออกเริ่มเปิดตาตื่น บนผืนแผ่นดินทั้งสองฝั่งของโลก มีเรื่องราวสุดพิเศษที่ต้องการที่จะถูกเล่าต่อไป...\r\n\r\nในหนึ่งวันที่มีฟ้าสดใสและลมหอนเบา เมื่อรัฐบาลและกระทรวงต่างๆ ของแผ่นดินต่างๆ พยายามให้โลกเป็นสถานที่ที่มีความสงบสุข และมนุษยชาติหลายแห่งเหล่าจะหันมองหาวิธีที่จะเข้าสังคมกันได้มากขึ้น ต่างชาติเริ่มสื่อสารกันมากขึ้น และโลกเหล่านี้เริ่มเข้าใจถึงความสำคัญของการทำงานร่วมกัน.\r\n\r\nในที่สุด มีการประชุมโลกที่ใหญ่ที่สุดที่เคยมีมา ผู้นำแต่ละประเทศจัดมาเพื่อหาทางในการแก้ไขปัญหาที่กำลังเผชิญหน้าอยู่ทั่วโลก. การเจรจาและการพูดคุยเต็มไปด้วยความรับผิดชอบและความเข้าใจ. สถานการณ์ที่แผ่นดินนี้เคยเสพติดอยู่กับการขัดแย้งและความขัดแย้งได้รับการแก้ไขด้วยความเข้าใจและการรอฟัง.\r\n\r\nกลายเป็นวันที่ประวัติศาสตร์ เมื่อสายสัมพันธ์ระหว่างประเทศถูกเข้าใจอย่างลึกซึ้ง และมนุษยชาติทั้งหลายต่างกลายเป็นนักสร้างสรรค์ของความเจริญก้าวหน้า. โลกทั้งหลายร่วมมือกันในการดำเนินชีวิตอันมีความคล่องตัวและสดใส, และการเปิดโอกาสให้ทุกคนทุกคนมีโอกาสที่สูงขึ้น.\r\n\r\nดังนั้น, พวกเราเดินไปข้างหน้าไปพร้อมกันในโลกที่แสนสวยงามนี้, ทั้งหมดทั้งปวงเป็นหนึ่งครอบครัวใหญ่ โลกนี้ได้กลายเป็นที่อยู่ของความรักและความสงบ. สวัสดี, โลกที่เติบโตขึ้นด้วยความรักและความเข้าใจ.'),
(3, '2024/01/03', 'นักรบดวงดว', 'ทดสอบระบบ 2 ', '\r\nนอกจากดวงดาวนั้นๆ บนท้องฟ้า มีเรื่องราวของนักรบดวงดาวที่ตื่นขึ้นเพื่อปกป้องความสงบในจักรวาลที่ราบรื่นและหลากหลายมิติ. เขาชื่อว่าไซอัน นักรบดวงดาวที่มีพรสวรรค์และพลังใจที่ร่าเริง, หวังเป็นที่ประจักษ์ในทุกมิติของอวกาศ.\r\n\r\nในสงครามระหว่างดวงดาว, ไซอันถูกเลือกเป็นนายทหารหลักของกองทัพดวงดาวสีขาว, ซึ่งมีหน้าที่ปกป้องดาวหลักๆ ในจักรวาล. เขามีสติปัญญาที่มีประสิทธิภาพและทักษะในการนำทีมที่โดดเด่น. กองทัพดวงดาวสีขาวสามารถลงทะเบียนในหลายดาวและรวมตัวกันในสงครามเพื่อปกป้องความสงบในทุกดาวที่อยู่ในความควบคุมของพวกเขา.\r\n\r\nในการผจญภัยของไซอัน, เขาเดินทางผ่านดวงดาวต่างๆ และเผชิญหน้ากับอุปสรรคที่หลากหลาย. เขาได้พบกับต่างดาวที่เต็มไปด้วยสิ่งแปลกประหลาดและมีการปรับตัวให้เข้ากับสภาพแวดล้อมต่างๆ. กลายเป็นทริปผจญภัยที่ท้าทายที่สุด, แต่ไซอันไม่เคยยอมแพ้.\r\n\r\nในตำนาน, นักรบดวงดาวไซอันกลายเป็นฮีโร่ที่สร้างความสงบและความยุติธรรมในทุกมิติของจักรวาล. เขาได้ปกป้องความสงบให้แก่ดาวต่างๆ และมีชื่อเสียงในสวรรค์และนรก.\r\n\r\nนักรบดวงดาวไซอันนั้นไม่เพียงเป็นตัวแทนของความสามารถทางทหารเท่านั้น, แต่เป็นตัวแทนของความเข้มแข็งทางจิตใจและปราชญ์กรุ๊ปที่ก้าวข้ามเขตแดนของดวงดาว. และเรื่องราวของไซอันก็ยังคงต่อเนื่องในท้องฟ้า, เป็นแรงบันดาลใจให้นักรบทุกคนที่มองหาความประสบความสำเร็จในอวกาศที่ไร้ขอบเขตนี้.');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `posts`
--
ALTER TABLE `posts`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `posts`
--
ALTER TABLE `posts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
